Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum
Defines the different profile item parameters types.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum.GENERAL_PARAMETERS
The general profile item parameters type.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum.ANALYSIS_PARAMETERS
The analysis profile item parameters type.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum.USER_PARAMETERS
The user profile item parameters type.